# 3-Задайте список из вещественных чисел. Напишите программу, 
# которая найдёт разницу между максимальным и минимальным значением дробной части элементов.

# Пример:
# [1.1, 1.2, 3.1, 5.17, 10.02] => 0.18 или 18
# [4.07, 5.1, 8.2444, 6.98] - 0.91 или 91

import random
# numbers = []
# for i in range(5):
#     numbers.append(random.uniform(0, 10))
# print(f' исходные значения {numbers}')

# decimal_parts = []
# for i in range(len(numbers)):
#     decimal_parts.append(str(numbers[i]).split('.')[1])
# print(decimal_parts)


# max_numbers = max(decimal_parts)
# min_number = min(decimal_parts)
# print(max_numbers, min_number)

# a = int(max_numbers) - int(min_number)
# print(a)


